42Crunch.vscode-openapi
alexcvzz.vscode-sqlite
amazonwebservices.aws-toolkit-vscode
be5invis.toml
bierner.markdown-mermaid
bruno-api-client.bruno
Catppuccin.catppuccin-vsc
chaliy.handlebars-preview
charliermarsh.ruff
DavidAnson.vscode-markdownlint
DiogoNolasco.pyinit
DotJoshJohnson.xml
drrouman.git-coauthors
eamodio.gitlens
EditorConfig.EditorConfig
exiasr.hadolint
Flixs.vs-code-http-server-and-html-preview
foxundermoon.shell-format
franneck94.vscode-python-config
franneck94.vscode-python-dev-extension-pack
GitHub.copilot
GitHub.copilot-chat
GitHub.github-vscode-theme
GitHub.remotehub
GitLab.gitlab-workflow
golang.go
Gruntfuggly.todo-tree
hashicorp.terraform
humao.rest-client
James-Yu.latex-workshop
janisdd.vscode-edit-csv
jasonnutter.vscode-codeowners
jebbs.plantuml
joyceerhl.vscode-dask
mermade.openapi-lint
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
mtxr.sqltools
mtxr.sqltools-driver-sqlite
njpwerner.autodocstring
njqdev.vscode-python-typehint
phoihos.csv-to-md-table
PKief.material-icon-theme
pnp.polacode
quicktype.quicktype
redhat.vscode-yaml
ryanluker.vscode-coverage-gutters
snowflake.snowflake-vsc
SonarSource.sonarlint-vscode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
wholroyd.jinja
wmaurer.change-case
yzane.markdown-pdf
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
