42crunch.vscode-openapi
alexcvzz.vscode-sqlite
amazonwebservices.aws-toolkit-vscode
be5invis.toml
bierner.markdown-mermaid
catppuccin.catppuccin-vsc
charliermarsh.ruff
davidanson.vscode-markdownlint
diogonolasco.pyinit
dotjoshjohnson.xml
drrouman.git-coauthors
eamodio.gitlens
editorconfig.editorconfig
exiasr.hadolint
flixs.vs-code-http-server-and-html-preview
foxundermoon.shell-format
franneck94.vscode-python-config
franneck94.vscode-python-dev-extension-pack
github.copilot
github.copilot-chat
github.github-vscode-theme
gitlab.gitlab-workflow
golang.go
gruntfuggly.todo-tree
hashicorp.terraform
humao.rest-client
james-yu.latex-workshop
janisdd.vscode-edit-csv
jasonnutter.vscode-codeowners
jebbs.plantuml
mermade.openapi-lint
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
mtxr.sqltools
mtxr.sqltools-driver-sqlite
njpwerner.autodocstring
njqdev.vscode-python-typehint
phoihos.csv-to-md-table
pkief.material-icon-theme
pnp.polacode
quicktype.quicktype
redhat.vscode-yaml
ryanluker.vscode-coverage-gutters
snowflake.snowflake-vsc
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
wholroyd.jinja
wmaurer.change-case
yzane.markdown-pdf
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
