42Crunch.vscode-openapi
adpyke.vscode-sql-formatter
be5invis.toml
cssho.vscode-svgviewer
DavidAnson.vscode-markdownlint
dnlytras.nord-wave
DotJoshJohnson.xml
dzgmelody.vscode-changelog-snippets
eamodio.gitlens
EditorConfig.EditorConfig
exiasr.hadolint
foxundermoon.shell-format
gardener.vscode-gardener-tools
GitHub.github-vscode-theme
golang.go
Gruntfuggly.todo-tree
hashicorp.terraform
humao.rest-client
Hyzeta.vscode-theme-github-light
Ikuyadeu.r
James-Yu.latex-workshop
janisdd.vscode-edit-csv
jebbs.plantuml
josephtbradley.hive-sql
lextudio.restructuredtext
lightbend.vscode-sbt-scala
matt-meyers.vscode-dbml
mermade.openapi-lint
ms-azuretools.vscode-docker
ms-kubernetes-tools.kind-vscode
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-account
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
mtxr.sqltools
naco-siren.gradle-language
njpwerner.autodocstring
PKief.material-icon-theme
pnp.polacode
quicktype.quicktype
redhat.java
redhat.vscode-yaml
richardwillis.vscode-gradle
scala-lang.scala
scalameta.metals
shanoor.vscode-nginx
SonarSource.sonarlint-vscode
streetsidesoftware.avro
tht13.html-preview-vscode
timonwong.shellcheck
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wholroyd.jinja
wmaurer.change-case
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
