42Crunch.vscode-openapi
ahmadalli.vscode-nginx-conf
amazonwebservices.aws-toolkit-vscode
be5invis.toml
chaliy.handlebars-preview
cssho.vscode-svgviewer
DavidAnson.vscode-markdownlint
DotJoshJohnson.xml
eamodio.gitlens
EditorConfig.EditorConfig
exiasr.hadolint
Flixs.vs-code-http-server-and-html-preview
foxundermoon.shell-format
GitHub.github-vscode-theme
GitHub.remotehub
GitLab.gitlab-workflow
golang.go
Gruntfuggly.todo-tree
hangxingliu.vscode-nginx-conf-hint
hashicorp.terraform
humao.rest-client
James-Yu.latex-workshop
jebbs.plantuml
lightbend.vscode-sbt-scala
mermade.openapi-lint
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode.makefile-tools
ms-vscode.remote-repositories
mtxr.sqltools
mtxr.sqltools-driver-pg
neilding.language-liquid
njpwerner.autodocstring
PKief.material-icon-theme
pnp.polacode
quicktype.quicktype
raynigon.nginx-formatter
redhat.java
redhat.vscode-yaml
REditorSupport.r
ritwickdey.LiveServer
scala-lang.scala
scalameta.metals
shanoor.vscode-nginx
SonarSource.sonarlint-vscode
streetsidesoftware.avro
timonwong.shellcheck
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wholroyd.jinja
wmaurer.change-case
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
