be5invis.toml
dnlytras.nord-wave
DotJoshJohnson.xml
dzgmelody.vscode-changelog-snippets
eamodio.gitlens
EditorConfig.EditorConfig
exiasr.hadolint
foxundermoon.shell-format
golang.go
GrapeCity.gc-excelviewer
hashicorp.terraform
HookyQR.beautify
humao.rest-client
Ikuyadeu.r
James-Yu.latex-workshop
lextudio.restructuredtext
lightbend.vscode-sbt-scala
ms-azuretools.vscode-docker
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
mtxr.sqltools
njpwerner.autodocstring
patbenatar.advanced-new-file
PKief.material-icon-theme
pnp.polacode
quicktype.quicktype
redhat.vscode-yaml
scala-lang.scala
scalameta.metals
shanoor.vscode-nginx
timonwong.shellcheck
wholroyd.jinja
wmaurer.change-case
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
