tap "gittower/tap"
tap "jkfran/killport"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "robscott/tap"
tap "ynqa/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Shell extension to jump to frequently used directories
brew "autojump"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Top-like interface for container metrics
brew "ctop"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Load/unload environment variables based on $PWD
brew "direnv"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Find files with SQL-like queries
brew "fselect"
# GNU compiler collection
brew "gcc"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Open-source GitLab command-line tool
brew "glab"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# High precision scientific calculator with support for physical units
brew "insect"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Postgres C API library
brew "libpq", link: true
# YAML Parser
brew "libyaml"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Fast, disk space efficient package manager
brew "pnpm"
# Modern replacement for ps written in Rust
brew "procs"
# Identify anything: emails, IP addresses, and more
brew "pywhat"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line interface for Vercel
brew "vercel-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Next-generation Git Flow tool
brew "gittower/tap/git-flow-next"
# A command-line tool to kill processes listening on a specific port
brew "jkfran/killport/killport"
# Install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"
# JSON navigator and interactive filter leveraging jq
brew "ynqa/tap/jnv"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Tools for building Android applications
cask "android-studio"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Free and open-source web browser
cask "chromium"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# AI code review CLI
cask "coderabbit"
# Write, edit, and chat about your code with AI
cask "cursor"
# Utilities designed to make common development tasks easier
cask "devtoys"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Utility to hide menu bar items
cask "hiddenbar"
# App to manage software development and track bugs
cask "linear-linear"
# Create mock APIs in seconds
cask "mockoon"
# Htop on steroids
cask "neohtop"
# App to write, plan, collaborate, and get organised
cask "notion"
# Email client integrated with Notion workspace
cask "notion-mail"
# Get up and running with large language models locally
cask "ollama-app"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do list
cask "todoist-app"
# Open-source code editor
cask "visual-studio-code"
# VPN client
cask "vyprvpn"
# Native desktop client for WhatsApp
cask "whatsapp"
# Voice-to-text dictation with AI-powered auto-editing
cask "wispr-flow"
# Multiplayer code editor
cask "zed"
vscode "42crunch.vscode-openapi"
vscode "alexcvzz.vscode-sqlite"
vscode "be5invis.toml"
vscode "bierner.markdown-mermaid"
vscode "bruno-api-client.bruno"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "diogonolasco.pyinit"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "drrouman.git-coauthors"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeryberger.scalene"
vscode "exiasr.hadolint"
vscode "foxundermoon.shell-format"
vscode "franneck94.vscode-python-config"
vscode "franneck94.vscode-python-dev-extension-pack"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "j-brooke.fracturedjsonvsc"
vscode "james-yu.latex-workshop"
vscode "jasonnutter.vscode-codeowners"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "openai.chatgpt"
vscode "phoihos.csv-to-md-table"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pomber.git-file-history"
vscode "pomdtr.excalidraw-editor"
vscode "quicktype.quicktype"
vscode "randomfractalsinc.duckdb-sql-tools"
vscode "redhat.vscode-yaml"
vscode "snowflake.snowflake-vsc"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "teticio.python-envy"
vscode "timonwong.shellcheck"
vscode "wholroyd.jinja"
vscode "wmaurer.change-case"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
