tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jkfran/killport"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "robscott/tap"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Utility that creates projects from templates
brew "cookiecutter"
# Top-like interface for container metrics
brew "ctop"
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Find files with SQL-like queries
brew "fselect"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Alternative to top/htop
brew "glances"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Platform built on V8 to build network applications
brew "node"
# High precision scientific calculator with support for physical units
brew "insect"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Optimized BLAS library
brew "openblas"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Build applications with serverless architectures
brew "serverless"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Command-line client for Travis CI
brew "travis"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line interface for Vercel
brew "vercel-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# A command-line tool to kill processes listening on a specific port
brew "jkfran/killport/killport"
# kube-capacity provides an overview of the resource requests, limits, and utilization in a Kubernetes cluster
brew "robscott/tap/kube-capacity"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Software for Logitech devices
cask "logitech-options"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Replacement for Docker Desktop
cask "orbstack"
# Archive manager for data compression and backups
cask "rar"
# Control your tools with a few keystrokes
cask "raycast"
# StrongDM client
cask "sdm"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "42Crunch.vscode-openapi"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "be5invis.toml"
vscode "bierner.markdown-mermaid"
vscode "bruno-api-client.bruno"
vscode "Catppuccin.catppuccin-vsc"
vscode "chaliy.handlebars-preview"
vscode "charliermarsh.ruff"
vscode "DavidAnson.vscode-markdownlint"
vscode "DiogoNolasco.pyinit"
vscode "DotJoshJohnson.xml"
vscode "drrouman.git-coauthors"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "exiasr.hadolint"
vscode "Flixs.vs-code-http-server-and-html-preview"
vscode "foxundermoon.shell-format"
vscode "franneck94.vscode-python-config"
vscode "franneck94.vscode-python-dev-extension-pack"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "James-Yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jasonnutter.vscode-codeowners"
vscode "jebbs.plantuml"
vscode "joyceerhl.vscode-dask"
vscode "mermade.openapi-lint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "phoihos.csv-to-md-table"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ryanluker.vscode-coverage-gutters"
vscode "snowflake.snowflake-vsc"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "wholroyd.jinja"
vscode "wmaurer.change-case"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
